//===========================================================
// Пример кода из видео (шаблон практического задания test_LVA).
// Демонстрирует нарушения корпоративного стандарта и градации
// решения: ПЛОХО / УДОВЛЕТВОРИТЕЛЬНО / ХОРОШО.
//===========================================================

test_LVA::test_LVA() : mcsCmd(NULL, _T("TEST_SAMPLE_LVA"), MCS_CMD_NOCHECK | MCS_CMD_NO_PREFIX)
{
}
//===========================================================

struct DataS
{
	char buf[0x1000000];
};
//===========================================================

bool func1(DataS& data)
{
	data.buf[1] = 1;
	return data.buf[0] != 0;
}
//===========================================================

DataS* func2(DataS& data)
{
	DataS dds;
	return &dds;
}
//===========================================================

HRESULT test_LVA::Execute(MCSVariant* pCustomParams)
{
	McsArray<int,int> arr;


	mcsTestTool_set_resValue(false);


	// ПЛОХО: строковый буфер
	// УДОВЛЕТВОРИТЕЛЬНО: инициализируем строковый буфер
	// ХОРОШО: посимвольно помещаем в cbuf строку вида '0123456789'

	//std::shared_ptr<DataS> pds = std::shared_ptr<DataS>(new DataS());
	//pds = NULL;
	char cbuf[100];

	int i;
	for(i = 10; i-->0; ) // пример мудрёного цикла
	//for(int i = 0; i < 10; ++i) // пример того же цикла, но проще
	{
		cbuf[i] = '0' + i;
	}
}
